app/controllers/articles_controller.rb

    def index
        @articles = Article.where(user_id: params[:user_id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 5]]

 def create
    puts params[:urlToImage]
    @article = Article.create(

      title: params[:title],
      author: params[:author],
      description: params[:description],
      url: params[:url],
      urlToImage: params[:urlToImage],
      publishedAt: params[:publishedAt],
      user_id: current_user.id
    )
---
INSERT INTO "articles" ("title", "author", "description", "url", "urlToImage", "publishedAt", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    @article = Article.find(params[:id])
    @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 74], ["LIMIT", 1]]
UPDATE "articles" SET "urlToImage" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["urlToImage", "http://mobiadhome.com/wp-content/uploads/2014/05/privacy-termsofruse.jpg"], ["updated_at", "2017-10-16 16:41:36.343863"], ["id", 93]]

  def destroy
    Article.destroy(params[:id])
    render json: Article.all
---
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 51]]
SELECT "articles".* FROM "articles"